const edges = [
  ["", ""],
  ["=", "="],
  ["(", ")"],
  ["⊂(", ")つ"],
  ["☜(", ")☞"],
  ["ʕノ", "ʔノ"],
  ["(˵", "˵)"],
  ["<{", "}>"],
  ["}>", "}>"],
  ["{", "}"],
  ["|", "|"],
  ["ԅ(", "ԅ)"],
  [")ᕗ", ")ᕗ"],
  ["ヽ(", ")ﾉ"],
  ["<(", ")>"],
  ["(╯", ")╯"],
  ["|(", ")|"],
  ["(", ")/"],
  ["╚(", ")╝"],
  ["(๑", "๑)"],
  ["[¬", "]¬"],
  ["ε(", ")з"],
  ["*(", ")*"],
  ["~=[", "]=~"],
  ["d[", "]b"],
  ["ヽ༼", "༽ﾉ"],
  ["ψ(", ")ψ"],
  ["(ღ", "ღ)"],
  ["(", ")⌐"],
  ["(づ｡", "｡)づ"],
  ["(੭*", ")੭* ̀"],
  ["／人", "人＼"],
  [")ง", ")ง"],
  [")/¯", ")/¯"],
  ["꒰", "꒱"],
  ["!!", "!!"],
  ["<", ">"],
  ["<|", "|>"],
  ["~|", "|~"],
  [":(", "):"],
  [":", ":"],
];

const eyes = [
  ["0", "0"],
  ["◉", "◉"],
  ["ㆆ", "ㆆ"],
  ["⌒", "⌒"],
  ["•`", "´•"],
  ["ⱺ", "ⱺ"],
  ["•͡", "•͡"],
  ["^.", ".^"],
  ["■", "■"],
  ["°", "°"],
  ["-", "-"],
  ["Ф", "Ф"],
  ["ຈ", "ຈ"],
  ["✜", "✜"],
  ["◕", "◕"],
  ["•́", "•̀"],
  ["ಥ", "ಥ"],
  ["⊙", "⊙"],
  ["Ó", "Ó"],
  ["•͡˘", "•͡˘"],
  ["┻", "┻"],
  ["ʘ̆", "ʘ̆"],
  ["Ɵ͆", "Ɵ͆"],
  ["≖", "≖"],
  ["╥", "╥"],
  ["°", "°"],
  ["︶", "︶"],
  ["°", "o"],
  ["⌐■", "■"],
  ["╹", "╹"],
  ["ˊ", "ˋ"],
  ["❍", "❍"],
  ["¬", "¬"],
  ["ಡ", "ಡ"],
  ["♥", "♥"],
  ["@", "@"],
  ["눈", "눈"],
  ["*", "*"],
  ["�", "�"],
  ["X", "X"],
  ["^", "^"],
  ["™", "™"],
  ["©", "©"],
  ["(©)", "(©)"],
  ["+", "+"],
  ["#", "#"],
];

const noses = [
  "",
  "‿",
  "_",
  "▽",
  "ʖ̯",
  "㇁",
  "ᴥ",
  "Y",
  "³",
  "ェ",
  "o",
  "౪",
  "ل͜",
  "‿‿",
  "︹",
  "Д",
  "⌂",
  "ヮ",
  "ʟ",
  ",,,,",
  "ω",
  "◞౪◟",
  "⌓",
  "____",
  "Ӝ",
  "﹏",
  "ਊ",
  "3",
  "⺫",
  "卌",
  "益",
  "Ω",
  "ᵕ",
  "﹃",
  ".",
  "෴",
  "__",
  "___",
  "..",
  "...",
  "O",
  ">",
  "<>",
];

function randomize(yourArray) {
  const number = Math.floor(Math.random() * yourArray.length);
  return number;
}

const generateFaces = () => {
  const edge = edges[randomize(edges)];
  const eye = eyes[randomize(eyes)];
  const nose = noses[randomize(noses)];

  const face = edge[0] + eye[0] + nose + eye[1] + edge[1];

  return face;
};

function renderSvg(text) {
  return `
    <svg xmlns="http://www.w3.org/2000/svg" width="350" height="350" version="1.1">
        <style>
            text {
                font-family: monospace;
                font-size: 42px;
                font-weight: 600;
            }
        </style>
        <rect width="350" height="350" fill="black"/>
        <text x="50%" y="50%" dominant-baseline="middle" text-anchor="middle" fill="white">${text}</text>
    </svg>
    `;
}

module.exports = {
  renderSvg,
  generateFaces,
};
